# FunctionId Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FunctionId Class
Members See Also
---
The information of a function throwing an exception.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class FunctionId : ISerializable
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class FunctionId _
	Implements ISerializable
```

Visual C++
---
```text
[SerializableAttribute]
public ref class FunctionId : ISerializable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.Exceptions..::..FunctionId
# See Also
FunctionId Members
Autodesk.Revit.Exceptions Namespace